[
    {
        "id": 1,
        "logo":"./images/universkin-white.svg",
        "title":" A Data-Driven Medical Solution for a Skin-Care Provider",
        "type": "Healthcare",
        "image": "./images/univerbig.webp",
        "about":"About the client",
        "AboutDescription": " Universkin is a European manufacturer of highly efficient skin care components for a data-driven holistic approach to tackling challenging facial skin conditions.",
        "location":"France",
        "secAbout":"About the project",
        "duscSecAbout":"The Universkin platform functions on a web basis. As such, it:Connects clients and doctors via respective accounts;Supports an online store of ready-made Universkin products.Features special services for doctors, e.g. serum preparation recommendations and the capability to track the patient's skin care journey;The resulting user flow is as follows. A patient uploads their photo and answers several questions. After that, proprietary AI-driven algorithms analyze their skin type and other characteristics and connect the client with a doctor. The doctor produces a skin care product (i.e. serum), tailored to the client's needs, from Universkin's ingredients. Then, the client receives the product, which specifically matches their skin type, by post.While working on this platform, our team of Pharma industry software experts, in close collaboration with the customer, gathered and analyzed tech requirements, developed the front-end and back-end parts, integrated the customer's AI into the back-end, tuned all notifications, and implemented communication channels.",
        "DURATION":"24 months",
        "TECHNOLOGIES":"Vue , js , Java , Python , MsSQL , AWS , JavaScript",
        "screenshot":"./images/screensht1.1.1.desktop.jpg",
        "Challenges":"Challenges",
        "ChallengesDusk":"This IT initiative posed a range of challenges that our team has successfully resolved, including:Ambitious global scale from the very beginning;Exceptional usability, both for medical providers and patients;Full compliance with HIPAA, GDPR, and PIPEDA standards;Seamless integration with payment systems and communication channels.",
        "Appfunctionality":"App functionality",
        "UserRegistration":"<h2>User registration</h2>",
        "UserRegistrationText":"Andersen designed and implemented a registration flow catered to the needs of doctors and patients, ensuring compliance with HIPAA and other data protection regulations.",
        "Dashboardmanagement":"<h2>Dashboard management</h2>",
        "DashboardmanagementText":"Since any treatment of skin conditions is universally based on individual cases, having a customizable dashboard is also essential for medical professionals using this solution.Therefore, our healthcare IT experts ensured a dashboard management capability, allowing users to manage the main page of the dashboard according to the available settings.Among other things, it enables medical professionals to add data and control the post-care stage (after the treatment is finished). On top of that, one can search for care receivers via the main page by names/emails/phone numbers. It is also possible to filter them by required parameters. All applicable parameters are divided into three sections, with a multiselection capability also available.",
        "notification":"<h2>Notifications</h2>",
        "Notificationstext":"Adherence to care routines is key. With this priority in mind, our experts added notifications to the solution's range of functionalities. These notifications remind users of the steps to be taken, following the care recommendations. Other notifications inform medical professionals about developments requiring their attention and their daily responsibilities regarding various treatment plans, ensuring they provide better care and miss nothing of importance.",
        "Userprofiles":"Treatment of various skin conditions remotely involves handling large quantities of patient information. In order to handle this challenge, our tech experts developed a comprehensive system of user profiles. The latter give the possibility to add, store, analyze, and use every needed piece of care data. The following sections can be found in the profiles: User profile picture;Personal data section; Various statuses, statistics, and options to change medical data according to the current state of the patient's skin; Capability to upload relevant medical documents.Therefore, medical professionals are in the right position to view health histories and diagnosis-related information, compare treatment results, and update treatment plans depending on the recommendations generated by advanced algorithms. The platform enables specialists to select the most effective treatment plans based on diagnostic results. In this fashion, the system helps to identify the most appropriate cosmeceuticals by displaying available products with data tags, divided into sections. The system also keeps a record of care recommendations, estimates the duration of a prescribed care plan, and tracks the user's skin care journey. As a result, proper care is received, while medical specialists can conveniently and seamlessly work on their cases.",
        "solutionPro":"solution",
        "solution":"In close cooperation with our analysts and software engineers, the skin care business has obtained a cutting-edge data-driven skin software tool for its users. Thanks to the personalized capabilities, the average duration required for treating a user's skin condition is reduced to a mere 5-6 weeks. Consequently, this has led to increased client loyalty and satisfaction rates, enabling the company to generate higher revenue and attract more customers.",
        "Projectresults":"Project results",
        "projectRes":"The launch of a customized online store;A new library applied to the admin panel;A delivery tracking system added, and a system for consumer reviews delivered;Integration with third parties ensured, including online payment systems;A more stable and reliable system;Integration with a CRM system;Full compliance with GDPR, HIPAA, and PIPEDA ensured;Thorough redesign of the system with an extension of its functionalities."
        
    },
    {
        "id": 2,
        "logo":"./images/verivox-logo-white.svg",
        "title":" A FinTech Portal to Compare Utility Payment Rates",
        "type": "Financial Services",
        "image": "./images/univerbig.webp",
        "about":"About the client",
        "AboutDescription": "Verivox, a European energy and utility price aggregator, has been making markets more transparent since 1998. They aim to save clients time and money by enabling comprehensive comparisons of tariffs and pricing plans. With over two billion euros saved for clients, the customer's proprietary Verivox portal is a dependable and trusted player in the market.",
        "location":"Germany",
        "secAbout":"Project overview",
        "duscSecAbout":"The Verivox price comparison portal project was focused on upgrading and modernizing the customer's platform for gathering, aggregating, and displaying multiple utility companies' rates to end-clients. Andersen's Front-end and Back-end engineering teams worked tirelessly to bring the platform's functionality to life so that visitors could easily compare rates via a comparison table and choose the most suitable vendor based on specified parameters. With an experienced Project Manager leading the process, our engineers followed the best industry practices to give Verivox a robust and efficient online consumer portal.The platform's ability to collect, bundle, and show rates from different utility companies has greatly improved, and the needs of Verivox have been successfully satisfied. A Tech Lead at Verivox praised our IT specialists for their swift onboarding and reliable, high-quality coding practices, stating that our developers became an integral and valuable part of their in-house Scrum team. Andersen's specialists have proved themselves to be the right choice, and Verivox is extremely satisfied with the results of the project.",
        "DURATION":"35+ months",
        "TECHNOLOGIES":"Angular ,  PHP ,  .NET",
        "screenshot":"./images/verifox1.1.desktop-2x.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"App functionality",
        "UserRegistration":"Profile management for utility companies (setting, editing, resetting passwords, and generating reports);Connection with partner services (creating apps, altering statuses, and generating reports);",
        "UserRegistrationText":"Andersen designed and implemented a registration flow catered to the needs of doctors and patients, ensuring compliance with HIPAA and other data protection regulations.",
        "Dashboardmanagement":"Implementing techniques like lazy loading, code splitting, caching, and Server-Side Rendering for performance optimization;",
        "DashboardmanagementText":"Enabling universal access, encompassing diverse needs. Includes alt text, keyboard navigation, semantic HTML, and screen reader support.Storage and versioning of partner site configurations (styles, headers, templates, and available options);",
        "notification":"Selection of services according to user-specified preferences and parameters;",
        "Notificationstext":"Implementing security measures like CSRF protection, sanitizing user input, etc;",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"Andersen's software engineers assisted the customer with the development and optimization of their Verivox price comparison calculator, observing and applying the best IT practices and working under the guidance of an industry-experienced Project Manager.",
        "Projectresults":"Project results",
        "projectRes":"Since our team had all the necessary resources and talent, the requested specialists were quickly assigned to work on the platform. This allowed the customer to avoid a time-consuming search for on-site IT experts, resulting in a 10% increase in development speed during the Verivox price comparison platform project.The quickly upgraded Verivox price comparison portal can now boast an improved ability to collect, aggregate, and display rates from multiple utility companies;The platform's performance has been successfully improved by our team, and the customer's needs have been successfully met.Andersen provided the needed expertise within 10 business days, which saved the customer a lot of time and resources;"
        
    },
    {
        "id": 3,
        "logo":"./images/PRElogo-white.svg",
        "title":"An Advanced Platform for Remote Learning Upgraded by Andersen",
        "type": "eLearning",
        "image": "./images/PREbig.webp",
        "about":"About the client",
        "AboutDescription": "Process Robotic Easy-Automation is a software engineering company specializing in the development of eLearning platforms and authoring tools. Their mission is to make digitalization easy for companies, and they support their clients at every development phase.",
        "location":"Germany",
        "secAbout":"Project overview",
        "duscSecAbout":"This IT project successfully implemented by our team was dedicated to improving and upgrading the PRE-A eLearning platform. The purpose of the platform is to provide end-users with advanced capabilities to generate and manage various content for remote education.Andersen's Front-end, Back-end, and QA teams involved in this eLearning platform project pursued several objectives. The end-users needed more than just the ability to create eLearning materials within seconds and with a few clicks and tailor these materials to various requirements.It was required to enable users to distribute digital content via a single centralized platform. In addition, they needed a reliable channel to cooperate with other authors, eLearning content creators, education officials, and course and knowledge managers.As a result, the companies interested in this solution were expected to be able to attain training objectives related to their employees. On top of that, they needed to have convenient access to professional documentation to do so.",
        "DURATION":"45+ months",
        "TECHNOLOGIES":"Java ,   JavaScript ,  jQuery",
        "screenshot":"./images/PRE1.1.desktop-2x.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"App functionality",
        "UserRegistration":"Capability to record and play lessons, as well as to create presentations in a fashion similar to PowerPoint. Lessons, in this case, denote simple screens that record and display user actions (e.g., mouse clicks, keyboard input, etc.) in prompts;Capability to convert files of various formats to PRS files supported by the platform. This feature enables content-creating end-clients to benefit from the capabilities offered by similar eLearning platforms and use their external content via the platform;",
        "UserRegistrationText":"Enabling universal access, encompassing diverse needs. Includes alt text, keyboard navigation, semantic HTML, and screen reader support;Capability to save and store various eLearning resources, files, and meta-info covering the latter. In addition, it is possible to track the current state of previously generated educational materials, manage access rights, and monitor the general progress made by end-users while studying these materials;",
        "Dashboardmanagement":"Capability to use the automatic search function based on their current contexts (EXE, etc.) to quickly find the right content for a specific user request, situation, or context. In addition, a capability of playback in a separate window is provided for the content they find;Enabling universal access, encompassing diverse needs. Includes alt text, keyboard navigation, semantic HTML, and screen reader support;Ensuring the web app is responsive and provides the best possible experience across different device types and sizes.",
        "DashboardmanagementText":"",
        "notification":"",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"Andersen's developers acted as an extended team. In this capacity, they assisted the customer in developing their remote learning platform in strict accordance with the best industry practices and under the guidance of an industry-experienced Project Manager.",
        "Projectresults":"Project results",
        "projectRes":"Improved user experience: the upgraded digital eLearning platform offers advanced capabilities for end-users to generate and manage various content for remote education;Increased effectiveness: users reach their learning objectives and have convenient access to professional documentation;As a result, we have made this eLearning platform 50% more effective.Increased collaboration: the platform enables users to distribute digital content via a centralized platform, allowing for easy cooperation with other authors, education officials, and course managers;Flexible content management: the platform allows users to save, store, and manage access rights to various eLearning resources, files, and meta-information. Additionally, it can convert files of various formats to PRS files."
       
    },
    {
        "id": 4,
        "logo":"./images/fti-white.svg",
        "title":"An Internal Tool for a Travel Company to Manage Vouchers",
        "type": "Travel & Hospitality",
        "image": "./images/flibig.webp",
        "about":"About the client",
        "AboutDescription": " FTI Group is the fourth-largest travel operator in Europe. The group is broadly represented by various brands and subsidiaries. With over 11,000 employees worldwide, FTI Group operates in six source markets and offers holiday packages in more than 120 countries.",
        "location":"Germany",
        "secAbout":"About the project",
        "duscSecAbout":"This partnership, which lasted for two years, relied on our teamwork to improve and streamline FTI Group's websites, introduce a voucher management system and checker, and redesign various modules of the official website. Andersen's team also conducted thorough UX research to enhance the user experience of the cross-platform mobile app. As part of the project, we developed an internal tool for FTI Group to manage their vouchers with ease and efficiency.<br><br><br>The results of the project spoke for themselves. PR Manager at FTI Group Gert Becker was full of praise for Andersen's contribution to the resulting voucher management software. He noted that the clean code, business-friendly ideas, and transparency of our engineers' work won their confidence, leading to the partnership extending to four subprojects in the travel industry. FTI Group entrusted Andersen with tasks of various complexity levels.",
        "DURATION":"23 months",
        "TECHNOLOGIES":"JavaScript , Vue.js , Angular , PHP , React.js , Firebase , +View all",
        "screenshot":"./images/fli1.1.desktop-2x.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"App functionality",
        "UserRegistration":"An extensive database of all the company's vouchers with a unified and simplified workflow for their operational processing and management;<br><br>",
        "UserRegistrationText":"An embedded plugin on the existing website for detailed management;<br><br>",
        "Dashboardmanagement":" Ensuring compatibility across different browsers and their various versions;<br><br>",
        "DashboardmanagementText":"An extension for using vouchers, their blocking, redemption, and filtering;<br>",
        "notification":"Implementing techniques like lazy loading, code splitting, caching, and Server-Side Rendering for performance optimization;",
        "Notificationstext":"Integrating with analytics tools to track user interactions and app performance.",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"In addition to the development of the digital voucher management system, our engineering team also created a separate website for internal use to make tracking issues and usage of vouchers easier and more efficient. The internal website contains all the information about them, stemming from all four company platforms, which allows managers to save time on tracking cost write-offs, choice of hotels and air tickets, etc.",
        "Projectresults":"Project results",
        "projectRes":"Andersen implemented one project from scratch that brought positive business results and helped to implement four other subprojects. The well-optimized tools and applications helped the customer focus on their crucial goals, attract more users, and reduce costs by optimizing their technical processes.<br><br>A unified and simplified workflow devised for operational processing and management of vouchers, resulting in increased efficiency and cost savings;<br>Website traffic increased through the development of a voucher management checker and redesign of several modules of the official website;<br>A dedicated internal website implemented for tracking the use of vouchers, allowing managers to save time and make more informed decisions;<br>UX research conducted, which helped to refine the cross-platform mobile app and create a more user-friendly experience for clients."
       
    },
    {
        "id": 5,
        "logo":"./images/tui-logo-color.svg",
        "title":"Internal Tools for a Travel Company",
        "type": "Travel & Hospitality",
        "image": "./images/tuibig.webp",
        "about":"About the client",
        "AboutDescription": "TUI is a leading travel and tourism service provider working all over the globe. Correspondingly, it has multiple offices in different countries and is determined to effectively manage its workflows.",
        "location":"Germany",
        "secAbout":"Project overview",
        "duscSecAbout":"TUI approached our company as a dependable provider of custom travel software. The customer's objective was to optimize their corporate workflows and make end-client services more user-friendly. Andersen's team was entrusted with engineering four advanced projects from scratch and providing advice on design, stemming from the top-notch travel website design examples. With a focus on intuitive navigation, accessible controls, and a user-friendly visual design, our UI/UX experts worked tirelessly to deliver top-quality solutions.<br><br>During the 22-month project, we applied such technologies as Golang, MongoDB, Vue.js, Node.js, HAPI, and Angular to craft an internal tool for managing regions, a system for tracking APIs, a service for transforming data, and a marketing tool for managing TUI's email campaigns. Since the customer didn't have its own IT staff, our company provided multitasking specialists to develop these software projects, working on several aspects at once.<br><br>TUI Deutschland was highly satisfied with the job performed by our Front-end development team. Their Tech Lead praised our hard-working and talented people who established open and honest communication, enabling a smooth workflow and allowing TUI to fully focus on their clients. The success of this project showcases Andersen's commitment to delivering top-quality solutions that drive tangible results for our customers.        ",
        "DURATION":"22 months",
        "TECHNOLOGIES":"Golang , MongoDB , Vue.js , Node.js , Hapi , Angular ,  +View all",
        "screenshot":"./images/tuidesktop.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"App functionality",
        "UserRegistration":"An internal tool for managing regions for tourism, grouping them while displaying on landing pages;<br>",
        "UserRegistrationText":"Displaying benefits of a particular booking and all monetary savings aggregated from the best tourism website examples;<br>",
        "Dashboardmanagement":"A marketing tool designed to manage TUI email campaigns for importing a JSON data file, using the tool to create or edit existing campaigns, and then export their updated version;<br>",
        "DashboardmanagementText":"Tracking an API using a region identifier that focuses on attracting leads;<br>",
        "notification":"A service that adapts the information to the appropriate format by collecting data and transforming it correctly;<br>",
        "Notificationstext":"Integrating with analytics tools to track user interactions and app performance.",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"Since TUI didn’t have its own engineering team, we provided multitasking specialists who assisted in the development of internal projects, including a travel website example, and worked on several aspects at once. The delivered solutions allow the customer's employees to interact with the internal database faster, manage content, and quickly reply to market needs. In addition, the resulting solutions are notable for their convenient, optimized, and streamlined UI/UX. As a result, the end-users now feel more engaged, satisfied, and effective at work.",
        "Projectresults":"Project results",
        "projectRes":"Andersen's team is thrilled to report that the project was a resounding success for our customer. Not only did the implementation of our cutting-edge tools reduce the time spent on the preparation of marketing materials by 30%, but they were also praised for their intuitive interface and usability by the customer's focus group. The success of this project demonstrates our commitment to delivering top-quality solutions that drive tangible results for our customers."
       
    },
    {
        "id": 6,
        "logo":"./images/samsung-color.svg",
        "title":"An Application for Samsung Smart TVs",
        "type": "Media & Entertanment",
        "image": "./images/sumsungbig.webp",
        "about":"About the client",
        "AboutDescription": "The customer was one of Samsung's affiliates. As such, this company works on the forefront of tech progress and hence only employs the best software vendors.",
        "location":"USA",
        "secAbout":"Project overview",
        "duscSecAbout":" An affiliate producing equipment for Samsung contacted our team and asked to build an innovative entertainment solution. Its main objective was to improve the UX of the customer's end clients using Samsung Smart TVs. Practically, it was planned to enable end-users to access video content via any device, watch TV shows, and manage their TV sets with a remote control app. Therefore, due to the rapid growth of video content sharing practices, the customer wanted to develop an app enabling its end-users to view movies and popular TV channels via both existing and new smart TVs.",
        "DURATION":"25 months",
        "TECHNOLOGIES":"SWIFT , Java , JS , .NET , C++",
        "screenshot":"./images/sumsungDiskdesktop@2x.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"Description <br><br>",
        "UserRegistration":"<h2>A thorough analysis of the customer's business requirements</h2><br>",
        "UserRegistrationText":"<p>Andersen's Business Analysts carefully assessed over 100 different TVs associated with the customer. The mission was to find the best way to build an innovative and quick application to cover both existing and new electronic products. More than that, since this app was supposed to match all end users' needs, our Business Analysts examined more than 50 competitors and identified features that were not available on the customer's existing applications.</p><br>",
        "Dashboardmanagement":"<h2>Development of an application for a wide range of TV models<h2><br><br>",
        "DashboardmanagementText":"A reliable base to develop an application for a wide range of TV models was constituted by a close collaboration between Andersen’s developers and the customer’s representatives.During the main development stage, our IT specialists applied the latest technologies to create a software solution capable of swiftly operating on devices with the minimum amount of RAM. Finally, a cross-platform app supporting over 55 modern TV models was developed.<br>",
        "notification":"",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"<h2>Implementation of smart typing tips</h2><br><br><p>Text input is the most inconvenient action that smart TV users face. In order to simplify this process, smart tips were added to the application. Now, users can see the right spelling for full words and phrases when they start to type them on the app.</p><br><img src='./images/typingscreen4-1-desktop@2x.webp'/><br><img src='./images/streaming4-3-desktop@2x.webp'/><br><h2>Intuitive navigation through the library</h2><br><p>Andersen’s team has enabled the customer's users to easily and  conveniently navigate through the library of the available video content. As an result, they can find, save, and view their preferred shows, movies, and TV series quickly and without difficulties.</p><br><img src='./images/library4-2-desktop@2x.webp'<br><h2>Streaming services</h2><br><p>Online entertainment is becoming the top choice for many viewers all over the world. In order to ensure the best possible UX, our experts envisioned an optimized layout and user journeys for those who prefer this type of entertainment.</p><br><br>",
        "Projectresults":"Project results",
        "projectRes":"After the app launch, the sales of the customer's TVs increased by 3%<br><br>83%of clients reported their full satisfaction within six months after the launch of the application<br><br>Moreover, almost 15% of end-users use the app for smart TVs as the main point<br><br>30%higher client engagement rate"
       
    },
    {
        "id": 7,
        "logo":"./images/elenderlogo-white.svg",
        "title":"A Software Solution for the Next-Gen Printing Industry",
        "type": "Enterprise",
        "image": "./images/elenderbig.webp",
        "about":"About the client",
        "AboutDescription": "Elanders is a UK-based provider of supply chain solutions. It also offers print and packaging services. As such, the business needed an advanced, user-friendly, and web-based ordering platform to simplify the process of printing files.",
        "location":"Germany",
        "secAbout":"Project overview",
        "duscSecAbout":"Elanders has developed advanced, user-friendly, and web-based ordering platforms that simplify the process of printing files. These IT solutions cover the entire workflow - from making orders for printing to delivering hard-copies (tailored-fit, just-in-time, or sequenced deliveries).<br><br>The old system used by the customer to manage PDF files could no longer meet modern requirements and became outdated. A new, user-friendly, and clear UI had to be created to ensure quick and convenient access to printing materials.<br><br>On the one hand, Andersen's development team helped to support and maintain the already existing system while simultaneously building a new version with improved functionality ",
        "DURATION":"2 years",
        "TECHNOLOGIES":"PHP , Vue.js , DevOps",
        "screenshot":"./images/elenderskreen1.1.desktop-2x.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"App functionality",
        "UserRegistration":"Planning operations and production activities;<br>",
        "UserRegistrationText":"Editing documents before printing (conversion from HTML to PDF, adaptation, etc.);<br>",
        "Dashboardmanagement":"Accepting and processing orders;<br>Synchronizing the database with user data and groups from the company's Active Directory;<br>Managing end-users and groups in the system;",
        "DashboardmanagementText":"Planning staff changes and work shifts;<br>Printing documents;<br>A UI for the company's staff;",
        "notification":"Authorizing end-users through the company's AD;<br>",
        "Notificationstext":"Ensuring the app is accessible for all users.",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"With both the old and the new systems securely available, needed files can be selected and stored for subsequent printing and processing. In addition, settings for cutting and further stapling activities can be defined.<br><img src='./images/printsol3.1.desktop-2x.webp'/><br>This has made it possible to seamlessly implement a new solution while retaining the full functionality of the old system.",
        "Projectresults":"Project results",
        "projectRes":"The delivered platform for Elander has simplified the printing process and streamlined the entire workflow;<br>The overall printing experience for Elander's clients has significantly improved.<br>The new platform has already proven to be successful with calendars printed as a pilot product;<br><img src='./images/pageShow4.1.desktop-2x.webp'/>"
       
    },
    {
        "id": 8,
        "logo":"./images/swiss_red_cross_color.svg",
        "title":"A Website for a Humanitarian Organization",
        "type": "Healthcare",
        "image": "./images/swissbig.webp",
        "about":"About the client",
        "AboutDescription": "The Swiss Red Cross is an international humanitarian organization working in more than 30 countries and implementing a variety of initiatives. The organization heavily relies on charity to provide aid for people in emergency situations. In order to facilitate efforts in this respect, their website has to meet corresponding standards of clarity, engagement, and payment processing.",
        "location":"Switzerland",
        "secAbout":"About the project",
        "duscSecAbout":"In this Red Cross case study, our company was contacted as a source of custom web development expertise to deliver an informative and user-friendly website. The resulting web presence was expected to feature swift journeys for engaging user sessions, be visually appealing to communicate organization values and purposes, and make the donation process convenient.",
        "DURATION":"12 months",
        "TECHNOLOGIES":"React/Next.js , CSS Modules , +View all",
        "screenshot":"./images/swissred1.1.desktop-2x.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"App functionality",
        "UserRegistration":"In order to relaunch the customer's web presence and address the above issues, we migrated the site to a headless React architecture. Additionally, we implemented a new HTTP cache validation strategy. This enabled the site to prevent superfluous queries and improved web browsing performance.<br><br>Here are the submitted deliverables:<br><br>Content Management System setup;<br>Runtime content update;<br>Payment services integration;<br>Implementing techniques like lazy loading, code splitting, caching, and Server-Side Rendering for performance optimization.",
        "UserRegistrationText":"",
        "Dashboardmanagement":"",
        "DashboardmanagementText":"",
        "notification":"",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"When working on this project, we tackled a range of tasks. First, in terms of layout, we created a design that would make users navigate towards the elements of chief importance to the customer. Second, our React web development specialists ensured high responsiveness for convenient user sessions via all browsers and devices (load time was reduced by almost 40%). Third, we took care of SEO issues to guarantee better indexation and increased visibility on the Internet. Finally, our team laid a foundation for simplified site maintenance and scalability for potential future improvements.<br><img src='./images/swisssollution3.1.desktop-2x'/>",
        "Projectresults":"Project results",
        "projectRes":"50% increase in the visitor base within 3 months of the launch<br>37% faster page load time"
       
    
    },
    {
        "id": 9,
        "logo":"./images/mercedeslogo-color.svg",
        "title":"High-Tech Entertainment E-Space for a Luxury Car Brand",
        "type": "Media & Entertainment",
        "image": "./images/mercresbig.webp",
        "about":"About the client",
        "AboutDescription": "Mercedes-Benz is a high-end luxury car manufacturer offering a range of products and services, including financing, leasing, car rental, fleet management, and innovative mobility services. They have a global presence of showrooms with their premium vehicles.",
        "location":"Germany",
        "secAbout":"Project overview",
        "duscSecAbout":"The local authorities in the customer's city made a decision concerning car dealerships – car showrooms had to be removed from the downtown area. The showrooms of Mercedes-Benz had to comply. In order to showcase the brand's vehicles, an innovative and digitized way needed to be found and implemented in technical terms. This is how the Mercedes Me Café concept was born. It was an important step towards the Mercedes-Benz digital transformation necessitated by the new promotion regulations. These Cafés are spaces where the brand can reach its potential clients.<br>This concept boasts a range of interactive elements to draw the guests’ attention to the Mercedes-Benz brand. These interactive user capabilities are delivered via touchscreen displays.<br>The marketing agency selected and contracted by Mercedes-Benz created the concept of Mercedes Me Café. This concept presupposed several sophisticated and challenging tech tasks. They were as follows:<br>Crafting the program component for the Mercedes Me Café infrastructure;<br>Generating a convenient, reliable, and intuitive system to visually select car configuration;<br>Delivering the software that would be a base for the required touchscreens;<br>Seamlessly integrating between ordering food, car configurations, and games.<br>Andersen’s technology experts, as a team with numerous entertainment projects behind them, won the bid to engineer software for Mercedes Me Café. This choice was determined by our broad IT experience and deep tech expertise in everything related to interactive and engaging solutions for entertainment and media. Another important factor was our advanced UI skills needed to ensure unique and pleasant user experiences for high-end audiences.",
        "DURATION":"5 months",
        "TECHNOLOGIES":"С# , ASP.NET , XAML , WinRT , LINQ, XML , Unity3D",
        "screenshot":"./images/mercroskreendesktop@2x.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"App functionality",
        "UserRegistration":"The solution makes it possible to order meals and drinks from the menu. These orders are then uploaded to the Café’s functional terminals to be processed by the Café’s staff. What is particularly important is that users interact with multimedia marketing content when using the menu;<br>",
        "UserRegistrationText":"Another challenge that we have successfully tackled has become a source of pride for us. Andersen's team developed a visual selection system for various car configurations. The Mercedes virtual showroom system uses a camera to analyze clients’ appearance, including their age, gender, clothing styles, hair, and other details. Based on that information, the system generates configuration suggestions;<br>",
        "Dashboardmanagement":"The five preinstalled games are a key attractive capability offered by the touchscreens. They are all designed in conformity with the Mercedes-Benz style and act as a user engagement factor;<br>Integrating with analytics tools to track user interactions and app performance.",
        "DashboardmanagementText":"The Café’s touchscreens are interconnected within a single network that has access to the Internet. Via them, users can surf the web and social platforms, use apps, pay their bills, interact with other screens, and view multimedia content;<br>",
        "notification":"In order to engage the guests of Mercedes Me Café even further, our car software experts added the possibility of creating dynamic videos. They are based on the choices end-users make and are intended to motivate them to sign-up for a test-drive of a Mercedes vehicle similar to a previously suggested configuration;<br>",
        "Notificationstext":"Ensuring the web app is responsive and provides the best possible experience across different device types and sizes;",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"The software for the Mercedes-Benz digital showroom was supposed to be built as an isolated Microsoft Windows app. Andersen’s engineers needed to develop a program capable of functioning in full-screen mode and excluding user access to other apps and OS services.<br>Some difficulties were caused by the need to launch various apps inside the software shell. In order to overcome and resolve those difficulties and deliver outstanding software for Mercedes-Benz, our developers built a sort of individual sub-OS to be launched inside Windows. This sub-OS runs its own web browser, social networks, email clients, and other apps. On top of that, the shell has an original UI with perfectly optimized controls for screens of various sizes. This is how we ensured the maximum level of convenience for all the visitors and guests of Mercedes Me Café.<br>The games had been developed by third-party developers and delivered before the Mercedes Me Café project started. As a result, they needed to be running within the entertainment solution without any visible involvement of Microsoft Windows. This situation caused another tech problem – by default, once the end-user exits the game, they inevitably return to the Windows interface, not the Café. Andersen’s team effectively dealt with this potential issue. Our IT specialists tailored the written code and integrated it into the interactive program shell. This made it possible to launch the games directly from the Mercedes Me Café software framework and return right to it after sessions end.",
        "Projectresults":"Project results",
        "projectRes":"The solution delivered by Andersen was a crucial part of the Mercedes Me Café car showroom project. As user reviews indicate, the target audience likes touchscreens. They also appreciate such opportunities as multimedia marketing materials, games, and the ability to select a car configuration.<br>The Mercedes Me Café project became effective leverage, attracting new local clients to Mercedes-Benz. It succeeded in directing potential clients to the dealerships’ showrooms, although there were no physical cars available.<br>Later, this successful project turned out to be an extra competitive advantage under the conditions imposed by the Covid-19 pandemic. With the need for greater social distancing, Mercedes Me Cafés can serve as a point for contactless purchases. On top of that, they can, in a digitized fashion, provide potential buyers with highly personalized and luxurious client experiences."
       
    
    },
    {
        "id": 10,
        "logo":"./images/task-dent-white-logo.svg",
        "title":"A Dental Business IT Solution",
        "type": "Healthcare",
        "image": "./images/taskdentbig.webp",
        "about":"About the client",
        "AboutDescription": "TaskDent is a team of doctors, IT engineers, and business analysts offering professional software for dental and medical practice owners to deal with daily practice financial data management, bookkeeping challenges, and analytics tasks.",
        "location":"USA",
        "secAbout":"About the project",
        "duscSecAbout":"Andersen was approached by TaskDent to develop a reliable solution for securely storing sensitive records that would be instantly accessible from any dental business location. TaskDent's previous method – using spreadsheets – proved to be ineffective in handling that heterogeneous data. With our assistance, an MVP of cloud dental practice management software was developed.<br>The result is a scalable data processing system built using Angular, React, and PHP technologies. This dental practice management system features a user-friendly interface, a monitoring dashboard, a metrics-tracking capability, user profiles and access rights, an intelligent structure of calculations and charts, convenient data input, and bookkeeping and financial monitoring capabilities. TaskDent's founder, Ali Bayat, praised our team for their contribution.",
        "DURATION":"10 months",
        "TECHNOLOGIES":"Angular , React , PHP , View all",
        "screenshot":"./images/dentist1.1.desktop-2x.webp",
        "Challenges":"Project details",
        "ChallengesDusk":"An all-in-one dental practice management platform with a user-friendly interface and an advanced monitoring dashboard, offering accurate and timely tracking of all the metrics of a dental business. The platform is capable of receiving and arranging data from all industry-specific data sources and websites and makes it possible to effectively manage accounts, revenues, expenses, etc. Andersen’s task was to ensure that this dental practice management system would be able to obtain, store, process, and provide easy and HIPAA-compliant access to multi-faceted data. There are plenty of data points encompassing information about dentists and their performance, patient medical records, healthcare facilities and their incomes, expenditures, etc.",
        "Appfunctionality":"App functionality",
        "UserRegistration":"Functionality for tracking income, expenses, and overall financial status, ensured by up-to-date metrics and analytics algorithms;<br>",
        "UserRegistrationText":"An intelligent structure of calculations and charts based on the uploaded numbers;",
        "Dashboardmanagement":"Assignment of daily and monthly tasks to prevent any discrepancies;",
        "DashboardmanagementText":"Implementing techniques like lazy loading, code splitting, caching, and Server-Side Rendering for performance optimization;<br>User profiles and access rights defined by admins only;",
        "notification":"Convenient data input (both manual and automated uploads) and report generation based on this data;",
        "Notificationstext":"Increased scalability and simpler integrations and migration ensured thanks to AWS-based data;",
        "Userprofiles":"Implementing security measures like CSRF protection, sanitizing user input, etc.",
        "solutionPro":"",
        "solution":"",
        "Projectresults":"Project results",
        "projectRes":"A feature-rich, customizable, and all-in-one solution for dental care financial monitoring has been developed and released by our team;<br>An SEO strategy and promotion channels have been defined after we conducted a professional analysis of competitors' traffic/ad activities;<br>Secure cloud-based data processing and storing ensured by restricted access;<br>Promotion across the entire US dental industry.<br>Easy bookkeeping, financial tracking, and analysis;<br>The product's potential to be customized for other clinical specialties;<br>Immediate access for all subscribed users to the reports and up-to-date analytics of HCP's financial data;"
       
    
    },
    {
        "id": 11,
        "logo":"./images/europcar-logo-color.svg",
        "title":"A Digital Platform for Car Rental",
        "type": "Logistics",
        "image": "./images/europcar-preview-1110x427.webp",
        "about":"About the Client",
        "AboutDescription": "Europcar, a Scandinavian market player and part of the world's largest car rental network, offers a platform with a web admin and cross-platform mobile app for renting and booking vehicles worldwide. The platform gives access to more than 190,000 vehicles and 13,000 rental stations. In collaboration with them, we delivered one of the best cross-platform app development examples that can be found in our portfolio.",
        "location":"France",
        "secAbout":"Project overview",
        "duscSecAbout":"Andersen partnered with Europcar to bring their vision of a digital car rental platform to life. The result is a well-architected serverless app consisting of a front-end web application and mobile app that interact with a range of basic microservices. Via the app, users can rent or book cars, filter options based on their class, cost, size, fuel consumption, and location, and access the car via Bluetooth. The app was designed to be user-friendly and easy-to-use, and it generated positive reviews from clients. The solution also provided flexibility for adding new API functionalities as the need arises. The successful project caught the eye of Europcar and was acquired as a white-label solution. Kristian Karimo, CEO at OurCnC, praised our dedicated and talented team for establishing a smooth workflow throughout the car rental app project.<br><br><br>Andersen's specialists developed a well-architectured serverless app following the best industry practices. The architecture itself consists of a front-end web app (CRM) and a mobile app interacting with a range of basical microservices. As a result, top-notch car rental capabilities have been ensured. Amazon Services were used to deliver this IT project, including S3, SQS, SNS, SES, RDS, CloudWatch, Lambda, API Gateway, Step Functions, CloudFront, Route 53, Elastic IP addresses, and SSM.",
        "DURATION":"36 months",
        "TECHNOLOGIES":"React Native , React.js , Node.js , AWS",
        "screenshot":"./images/earopSkreen1.1.desktop-2x.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"App functionality",
        "UserRegistration":"The resulting mobile car rental solution is very easy-to-use. All end clients need to do is install it, register with a phone number or any social media account, and add their ID and driving license info. After that, users can find the closest location and pick up a suitable car. Once the car is chosen, the user receives a password that allows them to open the vehicle via Bluetooth. Payment is conducted post-factum. Below is a more detailed and tech-oriented description of the project deliverables:<br>",
        "UserRegistrationText":"Mobile app (user management, keyless access to cars, etc.);<br>",
        "Dashboardmanagement":"Management panel (management of clients, stations, tasks, rental procedures, analytics, employees, etc.);<br>",
        "DashboardmanagementText":"Ensuring the app is accessible for all users.<br>Analytics (gathering clients’ feedback);",
        "notification":"Integration of third-party components (i.e. AWS as cloud solutions, the Stripe payment system as a gateway for online payments, CSM devices for remote control, Helpshift for communication with end clients and FAQ, etc.);",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"As mentioned above, this example of cross-platform apps consists of a mobile app and its management panel. Both iOS and Android-based devices can use this convenient mobile app so that their owners can enjoy the best possible user experience.",
        "Projectresults":"Project results",
        "projectRes":"Andersen's IT experts have created both the technical requirements and the design for this cross-platform application;<br>The resulting IT product has significantly reduced the number of human-caused errors;<br>As a result, one of Europe's largest rental car companies has purchased the app as a white-label solution.<br>The adaptable architecture of the IT solutions makes it simple to add new API features to satisfy evolving client demands;<br>Thus, our team has developed a user-friendly product that proves its effectiveness in such a competitive market;"
       
    
    },
   
    {
        "id": 12,
        "logo":"./images/asset_book.svg",
        "title":"An Asset Management App ",
        "type": "Financial Services",
        "image": "./images/assetbookbig.webp",
        "about":"About the Client",
        "AboutDescription": "The business goal that AssetBook pursues is to assist advisors with tackling their daily professional challenges via evaluation and diagnosis of their portfolio management and reporting practices, as well as with the crucial applicable business metrics.",
        "location":"USA",
        "secAbout":"About Project",
        "duscSecAbout":"Andersen helped the customer develop a modern, dependable, and high-performing asset management app. With the app at their disposal, end-users are able to spend much less time and effort evaluating the performance of their client's portfolios. For maximum convenience and efficiency, we took care of the asset management UI design as well. It enables users to run portfolios based on, among other things, the tracking of the asset condition and price, dynamics, pre-defined periods for measurements, profits and losses, etc. Finally, we provided high-level help with QA for such a demanding project.",
        "DURATION":"37 months",
        "TECHNOLOGIES":"TestRail , Pivotal , Git , Postman , npm , DevTools , +View all",
        "screenshot":"./images/assetskreen1-1-desktop@2x.webp",
        "Challenges":"Challenges",
        "ChallengesDusk":"While working on this IT asset management solution, our team faced and successfully resolved a range of challenges, including:<br>Absence of detailed documentation, which was impeding effective onboarding;<br>The requirement for the solution to function across four different browsers and two operating systems.<br>Tough deadlines for the planned release;<br> <img src='./images/assetbook8.1.desktop-2x.webp'/>",
        "Appfunctionality":"",
        "UserRegistration":"",
        "UserRegistrationText":"",
        "Dashboardmanagement":"",
        "DashboardmanagementText":"",
        "notification":"",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"The customer obtained a web and mobile platform relying on client-server architecture and a service approach. This platform makes it possible to monitor, report, and manage IT portfolios. End-users can allocate assets, track wealth, and ensure dependable custodial and tech integrations. The range of functionalities and features we delivered encompasses:<br>Engaging, simple, and intuitive portfolio management system engineered with an open API;<br>Powerful allocation monitoring capability featuring several layers for classification and reporting;<br>Portfolio cash management feature;<br>Tools for collaboration and client engagement.<br>Screens created to address most questions concerning portfolios – e.g. an overview of portfolio performance, tax considerations, or asset administration;<br>An automated fee billing system;<br>Advanced capabilities for tax planning and management;<br><br>Testing the app business logic (API) using Postman.<br><br><br><video autoplay loop controls><source src='./images/assetbookvideo.mp4' type='video/mp4'></video>",
        "Projectresults":"Project results",
        "projectRes":"Major defects in production have been prevented;<br>Test coverage has risen to 95%;Product satisfaction in the app store has improved, and the average score has risen;<br>The testing process has become crystal-clear and transparent for the stakeholders."
       
    
    },
    {
        "id": 13,
        "logo":"./images/management-events-logo-color.svg",
        "title":"An Event Management System for the Entertainment Industry",
        "type": "Media & Entertainment",
        "image": "./images/managementbig.webp",
        "about":"About the client",
        "AboutDescription": "Management Events is a pioneering business event management organization and networking solution provider with two decades of success. They bring together top leaders and solution providers for 180 events annually in Europe, offering a unique hybrid experience by combining virtual and physical environments.",
        "location":"Finland",
        "secAbout":"Project overview",
        "duscSecAbout":"The customer is a company engaged in managing business events. They thoroughly organize and optimize every single aspect and hence require software that automates the business processes, as well as stores and edits all the necessary information. Also, there was a need for a software solution to manage the customer’s extensive client base. The development of this solution was entrusted to us thanks to our wide pool of entertainment software specialists and our proven ability to help any events and entertainment company.",
        "DURATION":"48 months",
        "TECHNOLOGIES":"Postman , Swagger , MS SQL Server , Jenkins , NUnit , C# , +View all",
        "screenshot":"./images/hp1-1-desktop.webp",
        "Challenges":"Challenges",
        "ChallengesDusk":"No QA process in place for this online event management system project;<br>Insufficient park of real devices for testing iOS and Android app.<br>No defect management procedures;",
        "Appfunctionality":"",
        "UserRegistration":"",
        "UserRegistrationText":"",
        "Dashboardmanagement":"",
        "DashboardmanagementText":"",
        "notification":"",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"The experts established the QA process and normalized the communication between the event management system project software engineering teams and QA teams;<br>Andersen’s pool of real devices was made available for QA;<br>The application was covered with test documentation;<br>We automated testing process and implemented a script that automatically creates bugs from failed tests.",
        "Projectresults":"Project results",
        "projectRes":"Effective early testing has decreased the risk of errors significantly;<br>90% test coverage of the app<br> Considerable time was saved on QA, while maximum accuracy and quality were achieved;<br>40% less time spent on QA with the best results"
       
    
    },
    {
        "id": 14,
        "logo":"./images/propertyguru-color.svg",
        "title":"Real Estate Software Solutions",
        "type": "Real Estate",
        "image": "./images/properatybig.webp",
        "about":"About the Client",
        "AboutDescription": "Property Guru is a company working in the Real Estate industry. Their mission is to serve Real Estate buyers and investors on the one hand and property sellers on the other hand. Also, their listings include properties for rent.",
        "location":"Singapore",
        "secAbout":"About the project",
        "duscSecAbout":"Andersen provided its Back-end, Front-end, and Mobile developers for PropertyGuru. As a result of this assistance, the customer has obtained a range of client-centered real estate applications. Andersen's team has successfully built both the apps for individual users looking for real estate and the apps for agents to post offers with available apartments and houses.",
        "DURATION":"43 months",
        "TECHNOLOGIES":"Android , iOS , React Native , Python , Node.js , React",
        "screenshot":"./images/skreenproperty1.1.desktop-2x.webp",
        "Challenges":"",
        "ChallengesDusk":"By entrusting a range of complex tasks to our experts, the customer has successfully developed comprehensive real estate web and mobile applications enabling both agencies and clients to make deals and perform various transactions. Andersen's team has also built a digital property marketplace. As a result, the customer's platform has gained popularity in Singapore, Vietnam, Malaysia, and Thailand.<br><img src='./images/listproperty1.2.desktop-2x.webp'/>",
        "Appfunctionality":"",
        "UserRegistration":"",
        "UserRegistrationText":"",
        "Dashboardmanagement":"",
        "DashboardmanagementText":"",
        "notification":"",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"Andersen provided high-caliber assistance in building a B2B platform giving access to real estate information with all the relevant details properly covered. In addition, our team engineered web and mobile apps for the same real estate purposes.<br><img src='./images/aprartListproperty3.1.desktop-2x.webp'/>",
        "Projectresults":"Project results",
        "projectRes":"The catalogue solution built by our team of experts is notable for the following results:<br>Andersen created client-centered real estate apps for both individual users and agents, as well as a digital property marketplace;<br>The new real estate platform has become popular in Singapore, Vietnam, Malaysia, and Thailand."
       
    
    },
    {
        "id": 15,
        "logo":"./images/vita1699462784.svg",
        "title":"A Property Rent App for Student Support",
        "type": "Real Estate",
        "image": "./images/vita1699463194.webp",
        "about":" About the Client",
        "AboutDescription": "Andersen's customer, in this business case, was a company seeking to make accommodation and academic travel easier for international students. In this capacity, they wanted to offer a supporting property rental app capable of helping tenants during their stay. The resulting solution was requested to be easy-to-use yet feature-rich and comprehensive.",
        "location":"UK",
        "secAbout":"About the project",
        "duscSecAbout":"While engineering the ordered web-based tenant support app for property rent, we were entrusted with resolving an entire range of challenges. Among them were the creation of a structure of personal accounts to manage booking processes, as well as the upgrade and optimization of the booking system behind the solution.",
        "DURATION":"24+ months",
        "TECHNOLOGIES":"Node.js (NestJS) , PostgreSQL , Salesforce , AWS Lambda , AWS S3 , AWS EC2 , PHP laravel , microservices architecture , Salesforce , +View all",
        "screenshot":"./images/skreenvite1699514688.webp",
        "Challenges":"Challenges",
        "ChallengesDusk":"Andersen, as a team of property software experts, was asked to develop a protected and usable property renting web app to support tenants during their stay and manage their bookings via convenient personal accounts. The resulting solution was expected to be seamlessly integrated with an already existing Salesforce software suite to facilitate communication between students and the customer's employees working with them.",
        "Appfunctionality":"App functionality",
        "UserRegistration":"Andersen provided the customer with the following deliverables for their app for property rent:<br>",
        "UserRegistrationText":"Personal user accounts, including profile pages, the property rent app homepage displaying the latest updates and exclusive offers, etc.;<br>",
        "Dashboardmanagement":"Infrastructure to create and process support tickets for situations when renters face problems – for instance, when something is broken in a rented property;<br>",
        "DashboardmanagementText":"Incident alerts regarding, for instance, water or electricity outages;<br>",
        "notification":"Payment capabilities, including integrations with such service providers as TransferMate and GoCardless;<br>",
        "Notificationstext":"Opportunity to book premises for social group activities, e.g. movie screenings, via this property rental app;<br>",
        "Userprofiles":"Notifications of upcoming events and registration for them.",
        "solutionPro":"solution",
        "solution":"The customer has obtained what was requested – a student housing solution in full, on time, and within the budget. The web tool covers all the relevant needs of the tenants during the entire period of their stay in a particular property.",
        "Projectresults":"Project results",
        "projectRes":"The customer now has a ready-to-use solution for booking management and user support throughout the whole academic year. Also, the activities carried out by the customer's personnel have been automated."
       
    
    },
    {
        "id": 16,
        "logo":"./images/emfit_white.svg",
        "title":"An IoT-Based Health Tracking Solution for Medical Professionals",
        "type": "Healthcare",
        "image": "./images/emfitbig.webp",
        "about":" About the Client",
        "AboutDescription": "Emfit is a pioneering manufacturer of devices used for contactless tracking, measuring, and monitoring of vital health parameters. They specifically focus on sleep and recovery for personal wellness, elderly care, and clinical research.",
        "location":"Finland",
        "secAbout":"About the project",
        "duscSecAbout":"Andersen was approached to help develop Emfit's health tracking app focused on ballistocardiography. The customer had already developed some portions of their IoT health monitoring solution, but it still lacked some key features like the ability to administer the system and automate work on user requests. Andersen has built an IoT solution that collects a wide range of health data, analyzes and displays sleep statistics, and notifies clinicians in case of an emergency. The solution also includes such features as the ability to assess recovery levels of the heart muscles, remotely record patient indicators, and use an API for academic research.",
        "DURATION":"36 months",
        "TECHNOLOGIES":"Node.js , Angular , PHP , iOS , Android , +View all",
        "screenshot":"./images/emfit1-1-desktop@2x.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"App functionality",
        "UserRegistration":"Andersen crafted a web-based app leveraging ballistocardiography (the app is wirelessly connected to ferroelectric sensors, capturing intricate graphical representations of the rhythmic movements within the human body). The sensor can detect a forceful expulsion of blood into major vessels with each heartbeat and thus analyze heart rhythms and even estimate the power of a heart's contractions. Besides movements, the app also records other kinds of sleep statistics, like respiratory rates.",
        "UserRegistrationText":"As a result, this healthcare IoT platform can:<br>Collect a wide range of health data;",
        "Dashboardmanagement":"Notify medical personnel in case of emergency.",
        "DashboardmanagementText":"Analyze and display sleep statistics based on collected data;",
        "notification":"",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"Andersen's IT specialists delivered an app fully capable of analyzing sleep cycles. The resulting IoT-based health monitoring system records many health parameters, such as heart rates, body position, and even convulsions, etc. In addition, it can notify medical staff when necessary. The data itself is highly personalized, thus all the cybersecurity requirements were fully met.<br>As a result, this monitoring and tracking solution provides a detailed description of sleep quality and recovery progress. With such data, it is possible to make well-informed decisions regarding daily workouts, meetings, and other important activities.",
        "Projectresults":"Project results",
        "projectRes":"The web-based patient monitoring system successfully records patients' health indicators during sleep, which greatly improves the quality of care provided. Doctors and other medical staff have all the data at their disposal for comprehensive analysis. For instance, night shifts for hospital staff are now much more effective and safe, as nurses are always aware of their patients' conditions and whether anyone needs attention.<br>Also, the additional calculation algorithms we implemented have made it possible to increase the accuracy of the data received. The system has enabled the customer to process data supplied by 12,000 devices simultaneously.<br>Having contributed to the customer's plans, Andersen — as a center of tech expertise in IoT solutions and healthcare apps — has developed a software solution that is:<br>Able to assess the recovery levels of heart muscles (crucial for professional athletes, elderly people, and patients with chronic heart diseases);<br>Able to further use the API for academic research.<br>Able to record patient indicators remotely at clinics, with notifications sent to medical staff when needed (e.g. epileptic seizures);<br>89% Satisfaction rate<br>20% Increase in data accuracy"
       
    
    },
    {
        "id": 17,
        "logo":"./images/eliona-color.svg",
        "title":"A Smart Building Assistant Solution",
        "type": "Enterprise",
        "image": "./images/elionabig.webp",
        "about":"About the Client",
        "AboutDescription": "Eliona is a solution offered by Leicom AG. It operates in the automation and control technology industry, offering infrastructure system solutions and digital services.",
        "location":"Switzerland",
        "secAbout":"About the company",
        "duscSecAbout":"Andersen was approached by Leicom AG – a company that operates in the automation and control technology industry, offering infrastructure system solutions and digital services. The company is a smart building provider for digital infrastructures, with offices in five locations in Switzerland and Germany.",
        "DURATION":"28+ months",
        "TECHNOLOGIES":"React , C , JavaScript , PostgreSQL , Jest , +View all",
        "screenshot":"./images/eliona1.1.desktop-2x.webp",
        "Challenges":"Project overview",
        "ChallengesDusk":"The Eliona Smart Building Assistant enables users to interact with digital infrastructures and optimizes building and business processes. In this fashion, it increases the efficiency of facilities, employees, and processes via skilled Data Analysis and implementation of complex use cases.<br><br><img src='./images/eliona3dmodel3.1.desktop-2x.webp'/>",
        "Appfunctionality":"Key functionality",
        "UserRegistration":"Andersen has provided the customer with a tool capable of generating customized data visualizations and offering the best possible UX. Among other things, it offers the following functionality:",
        "UserRegistrationText":"Data display via charts and tables together with the tracking of device locations on maps, in 3D models, and in Augmented Reality;",
        "Dashboardmanagement":"A possibility to create thoroughly customized dashboards that take into account users' personal preferences and needs and are well-adapted to mobile devices;",
        "DashboardmanagementText":"Integrating with analytics tools to track user interactions and app performance;",
        "notification":"Advanced monitoring and data logging functionalities for a wide range of devices and resources;",
        "Notificationstext":"An alarm system with notifications automatically sent to all involved parties under certain conditions specified by the user;",
        "Userprofiles":"Implementing techniques like lazy loading, code splitting, caching, and Server-Side Rendering for performance optimization.",
        "solutionPro":"",
        "solution":"",
        "Projectresults":"Project results",
        "projectRes":"Andersen's QA team has built a testing framework for the project from scratch and introduced a test strategy, Asana flows, and a new GitFlow. Among other improvements implemented, the number of ad hoc bugs has decreased by 10%;<br>The percentage of tests passed has risen from 60% to 90%;<br>One-click deployment performed by an allocated DevOps engineer allows the customer’s end-clients (hospitals, industrial facilities, etc.) to deploy and start using the app much faster and easier. As a result, their client base is going to grow significantly."
       
    
    },
    {
        "id": 18,
        "logo":"./images/screach-logo.svg",
        "title":"A Sports Streaming and Entertainment IT Platform",
        "type": "Media & Entertainment",
        "image": "./images/screachbig.webp",
        "about":"About the Client",
        "AboutDescription": "Screach offers a feature-rich solution for live sports streaming and venue marketing used by sports pubs and bars all over the world. Their mission is to provide end-clients – i.e. venues for sports fans – with convenient and reliable access to live streams of sports events.",
        "location":"UK",
        "secAbout":"Project overview",
        "duscSecAbout":"Andersen's primary mission was to deliver a solution that would fully meet the ambitious requirements of the customer – a tool specifically catered to venues for sports fans. The resulting software was expected to grant convenient and reliable access to streamed live sports events on venues' terms. This priority mandated increased attention to the best industry practices and full consideration of the latest trends in the Live Streaming Software domain.<br>This sports streaming software project was delivered in full conformity with the ongoing tech trends Screach wanted to capitalize on. As we already mentioned, more and more sports broadcasters are switching from the traditional satellite approaches and relying on the potential of streaming. Hence our customer was determined to follow suit and provide a wider choice of live sports content for venues. The task was both ambitious and challenging, as the resulting all-in-one solution was supposed to serve as a one-stop shop for venues' TV entertainment and marketing needs.<br>As a result, our team engineered an IT solution that brings all the sports content providers together and delivers this content via a single, multi-functional app. The app generates enormous benefits for all the parties involved, i.e. the customer itself, their partner content providers, advertisers, venues, and sports fans. It can be downloaded via the Google Play Store (for Android-based set-top boxes, tablets, and smart TVs), LG Content Store (for LG smart TVs based on WebOS), and AWS Marketplace (for Fire TVs and Fire TV Sticks).",
        "DURATION":"12 months",
        "TECHNOLOGIES":"Angular , NodeJS , AWS , MongoDB , Microsoft Dynamics 365",
        "screenshot":"./images/scrcsport1.1.desktop-2x.webp",
        "Challenges":"Challenges",
        "ChallengesDusk":"Sports broadcasters are abandoning the traditional satellite framework and opting for streaming (OTT). The customer intended to follow that trend and offer a wider choice of live sports content for venues. Thus, the business ordered a live sports streaming platform for pubs and bars with venue marketing functionalities. The resulting solution was expected to ensure the best possible content consumption experiences for fans to ensure their loyalty to the venues and boost the venues' profitability.",
        "Appfunctionality":"",
        "UserRegistration":"",
        "UserRegistrationText":"",
        "Dashboardmanagement":"",
        "DashboardmanagementText":"",
        "notification":"",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"The customer has obtained a ready-to-use advanced app for Smart TVs. Now, they can broadcast both streamed live sports events and on-demand videos to fans – for example, matches and games that have already been held, together with other sorts of relevant video content related to sports and clubs. The app supports the entire range of expected functions, including time-shifting, pause, personal video recording, integration with the online store, and the ability to place venues' local ads or menus on the screen.<br>The platform crafted by our tech team has the following key features:<br>Rights-holders exercise 100% control over the content and pricing policies, as per a consumer app;<br>Full data analytics;<br>Optional anti-piracy watermarking.<br>No brand/product interference from the customer (i.e. there are no third-party ads);<br>The resulting enterprise app features the same content as the consumer solution;<br><br><img src='./images/scrsolution_1.webp'/><br><br><img src='./images/scrcsolution2.webp'/>",
        "Projectresults":"Project results",
        "projectRes":"Andersen's involvement in the project has ensured significant and value-adding changes for the Screach portal. Among other things, our contribution to the platform’s development includes the following features and modules:<br>Integration with social media;<br>TV guide/catch-up TV;<br>Customized subscription management for each of the venues;<br>Account management;<br>Onboarding;<br>Localization for Poland and Spain.<br>Media distribution;<br>Content store;<br>Admin panel for App management;<br>Chat integration;<br>Payment module;"
       
    
    },
    {
        "id": 19,
        "logo":"./images/versislogo1698742403.svg",
        "title":"A Drone Management Portal",
        "type": "Aviation",
        "image": "./images/versis1698742109.webp",
        "about":"About the Client",
        "AboutDescription": "In this business case, our customer was a company providing their end-clients, both privately owned and state-run ones, with an extensive range of integrated technologies based on the open standards created by The Spatial Web Foundation. The latter is non-profit, engineering open protocols and specs for next-gen web-based spatial solutions.",
        "location":"USA",
        "secAbout":"About the Project",
        "duscSecAbout":"With the envisioned drone flight management software solution at their disposal, the customer intended to resolve a major issue associated with the next-gen smart logistics industry. Namely, the resulting software was expected to tackle the problem of missing common formats to coordinate drone activities. In addition to that, the solution was required to be totally compliant with the applicable EU regulations.<br>It was the customer's key objective to apply the solution to various fields where drones could be used – e.g. last-mile delivery, emergency response, security monitoring, infrastructure inspection, etc.",
        "DURATION":"10 months",
        "TECHNOLOGIES":"JavaScript , TypeScript , Babylon.js , Apollo Client , React , React Testing Library , +View all",
        "screenshot":"./images/verisisSkreenshot1698744994.webp",
        "Challenges":"Business Context",
        "ChallengesDusk":"Andersen's team, in close collaboration with the customer's in-house IT staff, was tasked with crafting a web app for users to:<br>Monitor their drones on the map;<br>Make use of live video streaming capabilities.<br>Create and manage autonomous drone missions;",
        "Appfunctionality":"Challenges",
        "UserRegistration":"The main goal for us was more than just a drone software development initiative – the priority was to build a solution consisting of reusable components so that the customer could swiftly develop other portal sections based on them.",
        "UserRegistrationText":"<h2>App functionality</h2>",
        "Dashboardmanagement":"The web portal our team has contributed to makes it possible to outline, oversee, and control autonomous drone operations. The key functionalities of the drone software platform include:",
        "DashboardmanagementText":"Map view;",
        "notification":"Drone mission controls;",
        "Notificationstext":"Space and domain management features;",
        "Userprofiles":"Flight history records.",
        "solutionPro":"solution",
        "solution":"Andersen assigned a team of nine IT specialists to build the portal together with the customer's engineers. The portal can be described as a drone web app for users to view their drones on the map, create and manage autonomous drone missions, and utilize the live video streaming potential.<br>The main advantage of the web-based drone management platform is the possibility to conduct fully autonomous drone missions, with algorithms responsible for setting the most efficient paths. As a result, drones can fly without any human intervention.<br><img src='./images/versis1698742109.webp'/>",
        "Projectresults":"Project results",
        "projectRes":"The drone portal was created in full, on time, and within the budget. Via it, users are able to:<br>Track drone flights on the map;<br>View drone video streaming.<br>Create autonomous drone missions in full compliance with the EU drone-related laws;"
       
    
    },
    {
        "id": 20,
        "logo":"./images/ouantic-logo-color.svg",
        "title":"An AI-Based Tool for Data-Driven Decision-Making",
        "type": "Enterprise",
        "image": "./images/quantic_big.webp",
        "about":"About the Client",
        "AboutDescription": "Quantics is an AI company seeking to enable businesses to greatly optimize their operations based on data-driven decision making and reliable projections for better management. For this purpose, they asked us to build an MVP of an AI-based solution.",
        "location":"Austria",
        "secAbout":"Project overview",
        "duscSecAbout":"Recent progress in the AI field allows businesses to greatly optimize their operations based on data-driven decision-making and reliable projections for better management. Thus, Data Science and Big Data are quickly becoming invaluable and indispensable assistants for modern companies. Today, these technologies are enabling even the teams with limited IT talent and R&D budgets to become more competitive and profitable. The customer entrusted us with building such a cost-effective and easily available MVP. We assumed full responsibility for its design, front-end development, quality assurance, and project management, while the customer retained the back-end part.",
        "DURATION":"15 months",
        "TECHNOLOGIES":"React.js , RxJS , TypeScript , Python , +View all",
        "screenshot":"./images/quantitiyhomepage1.1.desktop-2x.webp",
        "Challenges":"",
        "ChallengesDusk":"",
        "Appfunctionality":"App functionality",
        "UserRegistration":"The range of advanced functionalities ensured and delivered by Andersen includes:",
        "UserRegistrationText":"Procedures to onboard new users, i.e. a training program and questionnaire with various types of questions;",
        "Dashboardmanagement":"Opportunity to generate different sorts of forecasts based on the data previously uploaded. On top of that, projection periods can be changed, types of displayed data can be selected, and various filters can be applied;",
        "DashboardmanagementText":"Several roles for users with varying access levels;",
        "notification":"Capability to upload new files containing business data for the last two years or more. It can be previewed as a table and edited;",
        "Notificationstext":"Ability to manually enter data that the system will apply to adjust the eventual forecast on an ML basis;",
        "Userprofiles":"Capability to share links leading to the generated forecasts and jointly edit them;<img src='./images/uploaddata3.1.desktop-2x.webp'/>",
        "solutionPro":"solution",
        "solution":"In order to implement such an ambitious AI initiative, Andersen's team started with a Discovery phase. Then, our experts envisioned and created an outstanding and intuitive design and documentation, including user stories and use cases. On top of that, we tuned a comprehensive testing process and, finally, developed a long-term work plan and a roadmap.",
        "Projectresults":"Project results",
        "projectRes":"Andersen’s contribution has greatly improved the overall quality of the product. As a result, our customer has found itself in the right position to successfully participate in a tender for state financing and win its first business end clients. Those first real users left positive feedback.<br>The intuitive MVP we delivered has empowered the business to make strategic decisions and optimize operations;<br>The solution has received overwhelmingly positive feedback from end-users and has led to successful client acquisitions."
       
    
    },
    {
        "id": 21,
        "logo":"./images/nyxoah_color.svg",
        "title":"A digital platform for obstructive sleep apnea patients ",
        "type": "Healthcare",
        "image": "./images/nyxoahbig.webp",
        "about":"About the client",
        "AboutDescription": "Nyxoah is a Belgium-based medical technology company. Their team is focused on the development and commercialization of innovative solutions to treat OSA (Obstructive Sleep Apnea).",
        "location":"Belgium",
        "secAbout":"Business requirements",
        "duscSecAbout":"The customer is Nyxoah – a Belgium-based medical technology company focused on the development and commercialization of innovative solutions to treat OSA (Obstructive Sleep Apnea).<br>Nyxoah approached Andersen with the need to define some growth opportunities, upgrade and redesign their web platform, and further contribute to improved lead conversion.<br>The requirements were focused on making the website more accessible and user-friendly by sending a clear message about the product and its points of sales, as well as highlighting the competitive advantages of the Genio solution.",
        "DURATION":"5 months",
        "TECHNOLOGIES":"React , PHP Laravel , +View all",
        "screenshot":"./images/genios1.1.5.desktop.png",
        "Challenges":"Project details",
        "ChallengesDusk":"Development of a brand new design and functionality for a web platform with a patient-centric neuromodulation solution to treat moderate to severe OSA – the world’s most common sleep-disordered breathing condition associated with increased mortality risk and comorbidities, including cardiovascular diseases, depression, and stroke.",
        "Appfunctionality":"Website functionality and upgrades",
        "UserRegistration":"UX audit of the website and versatile analysis (by accessibility, usability, competitors, consistency, etc.);<br>",
        "UserRegistrationText":"Redesign of webpages for better performance;<br>",
        "Dashboardmanagement":"SEO improvements (site map, tags, etc.);",
        "DashboardmanagementText":"Enabling universal access, encompassing diverse needs. Includes alt text, keyboard navigation, semantic HTML, and screen reader support;",
        "notification":"Admin panel changes and new functionality for improved content management;",
        "Notificationstext":"3D visualization of the landing page;",
        "Userprofiles":"Implementation of the design upgrades;<br>Ensuring the web app is responsive and provides the best possible experience across different device types and sizes.",
        "solutionPro":"",
        "solution":"",
        "Projectresults":"Project results",
        "projectRes":"Andersen's team provided a modern and dynamic design, which increased user engagement and led to a boost in the number of conversions.<br>Better website performance due to faster downloading and a user-friendly interface<br>According to the requirements, a website with a more accessible and user-friendly interface was created to help the customer achieve their business goals.<br>Advanced CMS with a customized administrative panel."
       
    
    },
    {
        "id": 22,
        "logo":"./images/unixtraffic.svg",
        "title":"A Web-Based Traffic Light Controller",
        "type": "Logistics",
        "image": "./images/unixtrafic.webp",
        "about":"About the company",
        "AboutDescription": "Andersen was approached by a British-based subsidiary of a European industrial giant involved in various sectors. This specific customer is engaged in developing innovative mobility ecosystems and services for smart, connected cities. Their mission is to advance next-gen mobility, making it safer, more resource-effective, and sustainable via forward-looking infrastructure and technology solutions.",
        "location":"UK",
        "secAbout":"Business Context",
        "duscSecAbout":"The fact that the customer is a contractor for the British government imposes extra stringent regulations in terms of safety, quality, and compliance on all their products, including this smart city traffic management system.<h2>Project overview</h2><br><br>The pioneering traffic management tool, to the development of which we contributed, functions as an emergency processor capable of taking over control of the signals from the main processor as a hot standby. This ensures maximum availability and makes it possible to enable over-the-air (OTA) updates during operations.",
        "DURATION":"12 months",
        "TECHNOLOGIES":"c++",
        "screenshot":"./images/unixtrafficskreenshot.webp",
        "Challenges":"Challenges",
        "ChallengesDusk":"The key challenge our team helped to resolve was the delivery of a traffic controller through a secure web interface, relying on browsers without the need for additional tools or software.",
        "Appfunctionality":"App functionality",
        "UserRegistration":"This IT project carried out with Andersen's assistance, as a developer of transport management solutions, is notable for an entire range of capabilities:<br>",
        "UserRegistrationText":"Connection of more than 64 signal groups and up to 256 detectors done easily and with minimal wiring. The modular design with serial module communication and SIL3 certification makes this possible;<br>",
        "Dashboardmanagement":"Support for end-users during project planning, with an intuitively understandable flow chart or, optionally, a structure diagram. This allows traffic engineering tasks to be converted into program code without any knowledge of domain-specific programming;<br>",
        "DashboardmanagementText":"In the user library, each user’s personal blocks can be stored, individually named, and combined with the PDM functions at any time. The block library grows with each completed project. Thanks to the S-L function, the individual blocks are already assembled. The user only needs to adapt them to the specific requirements of the intersection simply by parameterization.<br><img src='./images/homepageunix1705928120.webp'/>",
        "notification":"",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"The resulting solution helps city administrators and municipalities integrate and evolve intelligent strategies into their transport systems, enabling traffic managers to proactively manage traffic with virtual signage, connected infrastructure and vehicles, and other innovative solutions.",
        "Projectresults":"Project results",
        "projectRes":"While the project is still in progress, the following goals have been attained:<br>Full compliance with all project-related budget guidelines and milestones;<br>97% user satisfaction rates confirmed by preliminary user testing."
       
    
    },
    {
        "id": 23,
        "logo":"./images/simenslogo.svg",
        "title":"A Web App for Motor Engineering",
        "type": "Automotive",
        "image": "./images/loginsimensis.webp",
        "about":"About the Client",
        "AboutDescription": "Andersen was approached by a subsidiary of a major European machine-building and engineering enterprise. Their professional focus is on huge high-voltage motors, industrial generators, and convertors. As such, the customer's portfolio includes innovative solutions, digitalization projects, and a broad range of service offerings. They take great pride in delivering each end-product in a form that works best for their clients.",
        "location":"Germany",
        "secAbout":"About the project",
        "duscSecAbout":"Andersen successfully developed a web-based app encompassing all the steps engineers use to perform their calculations. The Business Analyst and designer we had assigned to this project thoroughly analyzed the calculation process to ensure the system could handle all required steps and presented that information comprehensively. The project was delivered in accordance with our Managed Delivery Service model.",
        "DURATION":"15 months",
        "TECHNOLOGIES":"React , TypeScript , Sass , .NET , PostgreSQL , Redis , +View all",
        "screenshot":"./images/homepagesimenses.webp",
        "Challenges":"Business Context",
        "ChallengesDusk":"The customer struggled with setting up a unified flow for the creation of electrical designs – i.e. the first part of the engineering process. Before our IT project started, their processes were mostly manual and involved several steps. Each step required a specific tool or a custom-created Excel calculator, resulting in the burden of managing many open tabs. This factor significantly affected the speed and convenience of their engineers' daily operations. Andersen helped to craft a web-based electrical design application combining all the necessary steps within a single process, thus reducing manual efforts.<br><br><h2>Challenges</h2><br><br><p>The customer adheres to the highest standards of quality and safety. Therefore, the challenge of performing swift and cost-effective yet precise and completely reliable calculations for large drivers was paramount. Previously, the customer’s engineers had to use a wide variety of systems and tools for these calculations. What's more, the process lacked automation, requiring many tasks to be performed manually.</p>",
        "Appfunctionality":"App functionality",
        "UserRegistration":"The resulting web-based app for internal use enables engineers to exercise access to all required data, including information from internal and third-party services, in one place and complete all steps of the electrical design process within a single unified system. This means they can load order data with varying configuration characteristics from SAP, find a similar variant already built, reuse this configuration with minor adaptations, find or add a new TRA (the specification of the motor geometry), perform pre-processing and post-processing calculations, create electrical designs, save order data back to SAP, and generate electrical documentation.",
        "UserRegistrationText":"",
        "Dashboardmanagement":"",
        "DashboardmanagementText":"",
        "notification":"",
        "Notificationstext":"",
        "Userprofiles":"",
        "solutionPro":"solution",
        "solution":"In order to develop automotive software that fully meets the customer's requirements, we have achieved the following objectives:<br><br>The time consumed by order engineering efforts has been reduced. The UI is clear and responsive. All the app's tabs have the same look and feel. Any engineer is always aware of their current process step, its status, and what the next step is. Data complexity stays hidden until the user explicitly asks for it. Finally, there is a general approach to presenting bulks of data;<br>The UI is simple, easy-to-use, and the data structures are transparent, thus, the learning curve is flat. The user is conducted through the process steps and supported by tooltips. Engineers who are not deeply familiar with the process can use it and be successful in their order management activities;<br>The app can be understood and used by all engineering teams located in Europe, the US, China, and India (the main language of the app is English).",
        "Projectresults":"Project results",
        "projectRes":"The app delivered by our team has helped to reduce the manual work loads on the customer's engineers. The company is now in the right position to process orders more effectively."
       
    
    },
    {
        "id": 24,
        "logo":"./images/xlnLogo.svg",
        "title":"Telecom CRM Modules",
        "type": "Telecom",
        "image": "./images/xlnhomepage.webp",
        "about":"About the company",
        "AboutDescription": "Andersen was approached by a British provider of telecom and utility services, working with 100,000 SMEs and start-ups. As a result of a merger with another major company with an extensive portfolio and a vast client base, the business faced the challenge of unifying their IT systems while catering for sales, provisioning, billing, and supporting an expanded product range. Andersen was contracted to tackle this task and expand the functionalities of their telecom CRM.",
        "location":"UK",
        "secAbout":"Project overview",
        "duscSecAbout":"The functionalities our team was requested to add were supposed to address the challenge of bringing new telecom products into the CRM including broadband and leased line solutions. The resulting CRM for the telecommunication company was expected to effectively support the sales and operations of the larger business group after the merger.",
        "DURATION":"12 months",
        "TECHNOLOGIES":".NET , Angular , MSSQL , C# , RxJs , TypeScript , +View all",
        "screenshot":"./images/xlnhomeskreenshot.webp",
        "Challenges":"Business Context",
        "ChallengesDusk":"Daisy Group, who has aquired XLN Telecom, has decided to keep their CRM system as the core for the merged company. This resulted in the need to migrate the features supporting the wider group's products into that system. Andersen was tasked with creating new modules for this purpose.<br><br><h2>Challenges</h2><br><br><p>The range of challenges we helped to tackle included a lack of QA and BA resources, as well as a lack of Angular developers required to develop the planned telecom CRM solution.</p>",
        "Appfunctionality":"App functionality",
        "UserRegistration":"When working on this telecom software development initiative, our engineers provided assistance with:",
        "UserRegistrationText":"Introducing new products into the telecom CRM;",
        "Dashboardmanagement":"Building a range of integrations;",
        "DashboardmanagementText":"Modernizing the design system and improving the usability levels;",
        "notification":"Streamlining component design in the CRM to reduce time to market;",
        "Notificationstext":"Tinkering with the CRM to handle new product lines (with bespoke product journeys);",
        "Userprofiles":"Reducing dependencies on third-party solution providers.<br><img src='./images/formxln.webp'/>",
        "solutionPro":"solution",
        "solution":"Andersen successfully overhauled the design system and added the requested new functionalities, relying on reusable component libraries. In addition to that, we contributed to improving the customer's in-house workflows based on Agile best practices and past project experiences. Additionally, we helped with adopting the CI/CD best practices and did UX research based on specific product journeys to improve the throughput.",
        "Projectresults":"Project results",
        "projectRes":"The resulting CRM solution has shown the following results:<br>200,000 clients being served;<br>Revenue flow beyond £200 million."
       
    
    }
   
]